##Задаем справочник
per_cent = {'ТКБ': 5.6, 'СКБ': 5.9, 'ВТБ': 4.28, 'СБЕР': 4.0}
##Указываем сумму, которую готовы внести
money = float (input('Укажите сумму для вклада: '))
##Рассчитываем доход в разрезе каждого Банка
TKB = int (per_cent['ТКБ'] * money)/100
SKB = int (per_cent['СКБ'] * money)/100
VTB = int (per_cent['ВТБ'] * money)/100
SBER = int (per_cent['СБЕР'] * money)/100
##Формируем перечень полученных значений
deposit = [TKB, SKB, VTB, SBER]
##Выводим этот перечень
print(deposit)
##Выводим максимальную сумму, которую можем получить на вкладе
print('Максимальная сумма, которую вы можете заработать — ', max(deposit))

